Revit 2027 API
ConduitSizeSettings.GetConduitSizeSettingsIterator Method
 Returns a ConduitSizeSettingIterator to the conduit size settings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConduitSizeSettingIterator GetConduitSizeSettingsIterator()
Public Function GetConduitSizeSettingsIterator As ConduitSizeSettingIterator
public:
ConduitSizeSettingIterator^ GetConduitSizeSettingsIterator()
member GetConduitSizeSettingsIterator : unit -> ConduitSizeSettingIterator
Return Value
ConduitSizeSettingIterator
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace